
  ___  ____  ____  ____  ____ ©
 /__    /   ____/   /   ____/      17.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2021 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core , expiring 29 Jul 2023
Serial number: 501709222714
  Licensed to: affliate
               Princeton University

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000; see help set_maxvar.

. do 2_clean_lease.do "/Users/vbp/Dropbox (Princeton)/wealth-housing/Code/Repli
> cation_VBP/Cleaning/Input/gov_uk" "/Users/vbp/Dropbox (Princeton)/wealth-hous
> ing/Code/Replication_VBP/Cleaning/Working/stata_working" 

. global DATA "`1'"

. global WORKING "`2'"

. 
. di "Data folder: $DATA"
Data folder: /Users/vbp/Dropbox (Princeton)/wealth-housing/Code/Replication_VBP
> /Cleaning/Input/gov_uk

. di "Working folder: $WORKING"
Working folder: /Users/vbp/Dropbox (Princeton)/wealth-housing/Code/Replication_
> VBP/Cleaning/Working/stata_working

. 
. import delimited "$DATA/LEASES_FULL_2022_06.csv", clear
(encoding automatically selected: ISO-8859-1)
(13 vars, 7,325,573 obs)

. rename uniqueidentifier unique_id 

. rename dateoflease date

. rename term lease_details

. rename associatedpropertydescription description

. keep unique_id date lease_details description

. 
. // Clean date
. 
. replace date = substr(date,4,7)
(7,324,868 real changes made)

. gen date_registered = date(date,"MY")
(705 missing values generated)

. gen  year = year(date_registered)
(705 missing values generated)

. gen quarter = quarter(date_registered)
(705 missing values generated)

. gen date_registered2 = year + (quarter-1)/4
(705 missing values generated)

. drop date_registered date

. rename date_registered2 date_registered

. 
. ////////////////////////////////////////////
> // Clean lease term based on GMS code
. ////////////////////////////////////////////
> 
. * Lease details hold information on lease length, generally a textual descrip
> tion.
. drop if lease_details == "No information available"
(0 observations deleted)

. drop if lease_details == ""
(41,015 observations deleted)

. drop if lease_details == "-"
(15 observations deleted)

. 
. compress
  variable year was float now int
  variable quarter was float now byte
  (36,422,715 bytes saved)

. 
. ********************************************************************
. * TYPOS - The textual description of in the "Lease Details" field
. *         contains a number of typos, that are dealt with here
. ********************************************************************
. 
. gen jan = regexs(0) if (regexm(lease_details,"Jan[a-z][a-z][a-z]y"))
(5,897,469 missing values generated)

. replace lease_details = subinstr(lease_details,jan,"January",.)
(715 real changes made)

. drop jan

. 
. gen jan = regexs(0) if (regexm(lease_details,"Jan[a-z][a-z][a-z][a-z]y"))
(7,284,455 missing values generated)

. replace lease_details = subinstr(lease_details,jan,"January",.)
(88 real changes made)

. drop jan

. 
. gen sept = regexs(0) if (regexm(lease_details,"Sep[a-z][a-z][a-z][a-z][a-z][a
> -z]"))
(6,446,262 missing values generated)

. replace lease_details = subinstr(lease_details,sept,"September",.)
(117 real changes made)

. drop sept

. 
. gen oct = regexs(0) if (regexm(lease_details,"Oct[a-z][a-z][a-z][a-z]"))
(6,930,772 missing values generated)

. replace lease_details = subinstr(lease_details,oct,"October",.)
(17 real changes made)

. drop oct

. 
. gen year_w = regexs(0) if (regexm(lease_details,"y[a-z][a-z][a-z]s"))
(628,500 missing values generated)

. replace lease_details = subinstr(lease_details,year_w,"years",.)
(194 real changes made)

. drop year_w

. 
. gen year_w = regexs(0) if (regexm(lease_details,"Y[a-z][a-z][a-z]s"))
(7,216,981 missing values generated)

. replace lease_details = subinstr(lease_details,year_w,"years",.)
(67,562 real changes made)

. drop year_w

. 
. *****************************************************************************
> ***************
. * More typos we discovered through manually inspecting files 
. *****************************************************************************
> ***************
. 
. replace lease_details = subinstr(lease_details,"Janaury","January",.)
(35 real changes made)

. replace lease_details = subinstr(lease_details,"Janusary","January",.)
(0 real changes made)

. replace lease_details = subinstr(lease_details,"Janauary","January",.)
(0 real changes made)

. replace lease_details = subinstr(lease_details,"Janury","January",.)
(105 real changes made)

. replace lease_details = subinstr(lease_details," anuary"," January",.)
(4 real changes made)

. 
. replace lease_details = subinstr(lease_details,"Febraury","February",.)
(64 real changes made)

. 
. replace lease_details = subinstr(lease_details,"Mrch","March",.)
(5 real changes made)

. replace lease_details = subinstr(lease_details,"Mrach","March",.)
(6 real changes made)

. 
. replace lease_details = subinstr(lease_details,"Deptember","December",.)
(4 real changes made)

. replace lease_details = subinstr(lease_details,"Decemer","December",.)
(14 real changes made)

. 
. replace lease_details = subinstr(lease_details,"Augsut","August",.)
(16 real changes made)

. 
. replace lease_details = subinstr(lease_details,"Sepember","September",.)
(37 real changes made)

. replace lease_details = subinstr(lease_details,"Setpember","September",.)
(12 real changes made)

. replace lease_details = subinstr(lease_details,"Septembeer","September",.)
(1 real change made)

. replace lease_details = subinstr(lease_details,"Setpembr","September",.)
(0 real changes made)

. 
. replace lease_details = subinstr(lease_details,"Ocober","October",.)
(117 real changes made)

. replace lease_details = subinstr(lease_details,"Ocotber","October",.)
(25 real changes made)

. replace lease_details = subinstr(lease_details," ctober"," October",.)
(35 real changes made)

. 
. * Fix spelling of "Year"
. replace lease_details = subinstr(lease_details,"yeas","years",.)
(49 real changes made)

. replace lease_details = subinstr(lease_details,"YEARS","years",.)
(237 real changes made)

. replace lease_details = subinstr(lease_details,"Years","years",.)
(0 real changes made)

. replace lease_details = subinstr(lease_details,"yers","years",.)
(6 real changes made)

. replace lease_details = subinstr(lease_details,"yeard","years",.)
(2 real changes made)

. replace lease_details = subinstr(lease_details,"Yers","years",.)
(0 real changes made)

. replace lease_details = subinstr(lease_details,"tears","years",.)
(235 real changes made)

. replace lease_details = subinstr(lease_details,"eyars","years",.)
(0 real changes made)

. 
. * Fix spelling of other common words in lease details data field
. replace lease_details = subinstr(lease_details,"unitl","until",.)
(0 real changes made)

. replace lease_details = subinstr(lease_details,"util","until",.)
(0 real changes made)

. 
. replace lease_details = subinstr(lease_details,"frm","from",.)
(408 real changes made)

. replace lease_details = subinstr(lease_details,"fron","from",.)
(6 real changes made)

. replace lease_details = subinstr(lease_details,"frorm","from",.)
(0 real changes made)

. replace lease_details = subinstr(lease_details," rom "," from ",.)
(363 real changes made)

. 
. replace lease_details = subinstr(lease_details,"( hereof)","",.)
(0 real changes made)

. 
. replace lease_details = subinstr(lease_details,"commending","commencing",.)
(0 real changes made)

. 
. replace lease_details = subinstr(lease_details," fro "," for ",.)
(276 real changes made)

. 
. replace lease_details = subinstr(lease_details,"incuding","including",.)
(1 real change made)

. replace lease_details = subinstr(lease_details,"working","",.)
(1,672 real changes made)

. 
. foreach yyy in "99" "125" "250" "999" "189" "199" "200" "800" "155" "990" "12
> 0" "1000" "998" "900" "100" {
  2.     replace lease_details = subinstr(lease_details,"`yyy' year ","`yyy' ye
> ars ",.)
  3. }
(805 real changes made)
(397 real changes made)
(155 real changes made)
(0 real changes made)
(39 real changes made)
(0 real changes made)
(41 real changes made)
(13 real changes made)
(26 real changes made)
(9 real changes made)
(24 real changes made)
(6 real changes made)
(9 real changes made)
(1 real change made)
(3 real changes made)

. 
. replace lease_details = trim(lease_details)
(1,976 real changes made)

. replace lease_details = itrim(lease_details)
(44,834 real changes made)

. 
. ***********************************************************
. * Fix missing "years", e.g., "125 from 12 December...."
. ***********************************************************
. 
. * CASE 1
. gen h1 = regexs(0) if (regexm(lease_details,"^[1-9][0-9][0-9] "))
(2,208,157 missing values generated)

. gen h2 = regexs(0) if (regexm(lease_details,"^[1-9][0-9][0-9] y"))
(2,220,642 missing values generated)

. 
. gen action = 1 if h1 != "" & h2 == ""
(7,272,058 missing values generated)

. gen new    = h1 + "years "

. replace lease_details = subinstr(lease_details,h1,new,.) if action == 1
(12,485 real changes made)

. 
. drop h1 h2 action new

. 
. * CASE 2
. gen h1 = regexs(0) if (regexm(lease_details,"^[1-9][0-9][0-9][0-9] "))
(7,227,384 missing values generated)

. gen h2 = regexs(0) if (regexm(lease_details,"^[1-9][0-9][0-9][0-9] y"))
(7,227,860 missing values generated)

. 
. gen action = 1 if h1 != "" & h2 == ""
(7,284,067 missing values generated)

. gen new    = h1 + "years "

. replace lease_details = subinstr(lease_details,h1,new,.) if action == 1
(476 real changes made)

. 
. drop h1 h2 action new

. 
. * CASE 3
. gen h1 = regexs(0) if (regexm(lease_details,"^[1-9],[0-9][0-9][0-9] "))
(7,280,077 missing values generated)

. gen h2 = regexs(0) if (regexm(lease_details,"^[1-9],[0-9][0-9][0-9] y"))
(7,280,144 missing values generated)

. 
. gen action = 1 if h1 != "" & h2 == ""
(7,284,476 missing values generated)

. gen new    = h1 + "years "

. replace lease_details = subinstr(lease_details,h1,new,.) if action == 1
(67 real changes made)

. 
. drop h1 h2 action new

. 
. * CASE 4
. gen h1 = regexs(0) if (regexm(lease_details,"^[1-9][1-9] "))
(6,063,702 missing values generated)

. gen h2 = regexs(0) if (regexm(lease_details,"^[1-9][1-9] y"))
(6,074,369 missing values generated)

. 
. gen action = 1 if h1 != "" & h2 == ""
(7,273,876 missing values generated)

. gen new    = h1 + "years "

. replace lease_details = subinstr(lease_details,h1,new,.) if action == 1
(10,667 real changes made)

. 
. drop h1 h2 action new

. 
. **********************************************************************
. * Remove "Day" Transaction Details
. * - Some lease details state, for example, "999 years (less 2 days)"
. * - We want to focus on the important part of years.
. **********************************************************************
. 
. foreach k in "2" "3" "4" "5" "6" "7" "8" "9" "10" "11" "12" "13" "14" "15" "1
> 6" "17" "18" "19" "20" "21" ///
>              "two" "three" "four" "five" "six" "seven" "eight" "nine" "ten" "
> eleven" "twelve" "thirteen" ///
>                          "fourteen" "fiveteen" "sixteen" "seventeen" "eightee
> n" "nineteen" "twenty" {
  2.                          
.         replace lease_details= subinstr(lease_details,"(less `k' days)","",.)
  3.         replace lease_details= subinstr(lease_details,"less `k' days","",.
> )
  4.         replace lease_details= subinstr(lease_details,"(Less `k' days)",""
> ,.)
  5.         replace lease_details= subinstr(lease_details,"Less `k' days","",.
> )
  6.         
.         replace lease_details= subinstr(lease_details,"(less `k' months)","",
> .)
  7.         replace lease_details= subinstr(lease_details,"less `k' months",""
> ,.)
  8.         replace lease_details= subinstr(lease_details,"(Less `k' months)",
> "",.)
  9.         replace lease_details= subinstr(lease_details,"Less `k' months",""
> ,.)
 10.         
.         replace lease_details= subinstr(lease_details,"(less last `k' days)",
> "",.)
 11.         replace lease_details= subinstr(lease_details,"less last `k' days"
> ,"",.)
 12.         replace lease_details= subinstr(lease_details,"(Less last `k' days
> )","",.)
 13.         replace lease_details= subinstr(lease_details,"Less last `k' days"
> ,"",.)
 14.         
.         replace lease_details= subinstr(lease_details,"(minus last `k' days)"
> ,"",.)
 15.         replace lease_details= subinstr(lease_details,"minus last `k' days
> ","",.)
 16.         replace lease_details= subinstr(lease_details,"(minus last `k' day
> s)","",.)
 17.         replace lease_details= subinstr(lease_details,"minus last `k' days
> ","",.)
 18.         
.         replace lease_details= subinstr(lease_details,"(minus `k' days)","",.
> )
 19.         replace lease_details= subinstr(lease_details,"minus `k' days","",
> .)
 20.         replace lease_details= subinstr(lease_details,"(minus `k' days)","
> ",.)
 21.         replace lease_details= subinstr(lease_details,"minus `k' days","",
> .)
 22.         
.         replace lease_details= subinstr(lease_details,"(less the last `k' day
> s thereof)","",.)
 23.         replace lease_details= subinstr(lease_details,"less the last`k' da
> ys thereof","",.)
 24.         replace lease_details= subinstr(lease_details,"(Less the last`k' d
> ays thereof)","",.)
 25.         replace lease_details= subinstr(lease_details,"Less the last `k' d
> ays thereof","",.)
 26.         
.         replace lease_details= subinstr(lease_details,"(less last `k' days th
> ereof)","",.)
 27.         replace lease_details= subinstr(lease_details,"less last`k' days t
> hereof","",.)
 28.         replace lease_details= subinstr(lease_details,"(Less last`k' days 
> thereof)","",.)
 29.         replace lease_details= subinstr(lease_details,"Less last `k' days 
> thereof","",.)
 30.         
.         replace lease_details= subinstr(lease_details,"(less the last `k' day
> s)","",.)
 31.         replace lease_details= subinstr(lease_details,"less the last`k' da
> ys","",.)
 32.         replace lease_details= subinstr(lease_details,"(Less the last`k' d
> ays)","",.)
 33.         replace lease_details= subinstr(lease_details,"Less the last `k' d
> ays","",.)    
 34.         
.         replace lease_details= subinstr(lease_details,"(except the last `k' d
> ays thereof)","",.)
 35.         replace lease_details= subinstr(lease_details,"except the last`k' 
> days thereof","",.)
 36.         replace lease_details= subinstr(lease_details,"(except the last`k'
>  days thereof)","",.)
 37.         replace lease_details= subinstr(lease_details,"except the last `k'
>  days thereof","",.)
 38.         
.         replace lease_details= subinstr(lease_details,"(except the last `k' d
> ays)","",.)
 39.         replace lease_details= subinstr(lease_details,"except the last`k' 
> days","",.)
 40.         replace lease_details= subinstr(lease_details,"(except the last`k'
>  days)","",.)
 41.         replace lease_details= subinstr(lease_details,"except the last `k'
>  days","",.)  
 42. }
(6,266 real changes made)
(1,351 real changes made)
(35 real changes made)
(0 real changes made)
(27 real changes made)
(17 real changes made)
(0 real changes made)
(0 real changes made)
(4 real changes made)
(3 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(10 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(4 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(106,259 real changes made)
(27,127 real changes made)
(521 real changes made)
(17 real changes made)
(1,799 real changes made)
(146 real changes made)
(2 real changes made)
(1 real change made)
(589 real changes made)
(127 real changes made)
(5 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(221 real changes made)
(0 real changes made)
(0 real changes made)
(3 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(585 real changes made)
(0 real changes made)
(0 real changes made)
(3 real changes made)
(28 real changes made)
(0 real changes made)
(0 real changes made)
(4 real changes made)
(37 real changes made)
(0 real changes made)
(0 real changes made)
(17 real changes made)
(1,750 real changes made)
(277 real changes made)
(7 real changes made)
(0 real changes made)
(5 real changes made)
(6 real changes made)
(0 real changes made)
(0 real changes made)
(3 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(3 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(25,017 real changes made)
(9,783 real changes made)
(110 real changes made)
(1 real change made)
(10 real changes made)
(8 real changes made)
(0 real changes made)
(0 real changes made)
(33 real changes made)
(20 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(14 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(34 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(5 real changes made)
(3,592 real changes made)
(868 real changes made)
(19 real changes made)
(1 real change made)
(202 real changes made)
(22 real changes made)
(0 real changes made)
(0 real changes made)
(4 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(3 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(9,998 real changes made)
(2,274 real changes made)
(17 real changes made)
(4 real changes made)
(6 real changes made)
(13 real changes made)
(0 real changes made)
(0 real changes made)
(99 real changes made)
(24 real changes made)
(3 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(47 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(228 real changes made)
(0 real changes made)
(0 real changes made)
(3 real changes made)
(37 real changes made)
(0 real changes made)
(0 real changes made)
(18 real changes made)
(52 real changes made)
(0 real changes made)
(0 real changes made)
(30 real changes made)
(784 real changes made)
(146 real changes made)
(2 real changes made)
(0 real changes made)
(3 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(946 real changes made)
(229 real changes made)
(1 real change made)
(0 real changes made)
(11 real changes made)
(4 real changes made)
(0 real changes made)
(0 real changes made)
(3 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(159,602 real changes made)
(27,880 real changes made)
(703 real changes made)
(25 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(948 real changes made)
(334 real changes made)
(12 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(519 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1,266 real changes made)
(0 real changes made)
(0 real changes made)
(8 real changes made)
(189 real changes made)
(0 real changes made)
(0 real changes made)
(54 real changes made)
(267 real changes made)
(0 real changes made)
(0 real changes made)
(234 real changes made)
(943 real changes made)
(210 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(3 real changes made)
(0 real changes made)
(0 real changes made)
(5 real changes made)
(3 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(379 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(5 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(860 real changes made)
(120 real changes made)
(7 real changes made)
(0 real changes made)
(3 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(80 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(5 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(795 real changes made)
(40 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(3 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1,295 real changes made)
(272 real changes made)
(2 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(5 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(170 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(3 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(3,271 real changes made)
(2,206 real changes made)
(6 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(10 real changes made)
(3 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7 real changes made)
(0 real changes made)
(0 real changes made)
(147 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(162 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(4 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(193 real changes made)
(81 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(77 real changes made)
(51 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(4 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(15 real changes made)
(8 real changes made)
(1 real change made)
(0 real changes made)
(11 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(54 real changes made)
(14 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7,819 real changes made)
(3,039 real changes made)
(22 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(37 real changes made)
(9 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(558 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(112 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(6 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(12 real changes made)
(0 real changes made)
(0 real changes made)
(4 real changes made)
(1,208 real changes made)
(524 real changes made)
(7 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8 real changes made)
(5 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(7 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(13 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(396 real changes made)
(220 real changes made)
(48 real changes made)
(1 real change made)
(8 real changes made)
(266 real changes made)
(0 real changes made)
(0 real changes made)
(3 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(12 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(4 real changes made)
(6,452 real changes made)
(4,987 real changes made)
(92 real changes made)
(2 real changes made)
(141 real changes made)
(193 real changes made)
(1 real change made)
(0 real changes made)
(29 real changes made)
(17 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(118 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(262 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(24 real changes made)
(0 real changes made)
(0 real changes made)
(3 real changes made)
(21 real changes made)
(0 real changes made)
(0 real changes made)
(9 real changes made)
(164 real changes made)
(27 real changes made)
(0 real changes made)
(0 real changes made)
(3 real changes made)
(3 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(3 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(10 real changes made)
(879 real changes made)
(487 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(20 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(27 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(222 real changes made)
(44 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(705 real changes made)
(327 real changes made)
(1 real change made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(11 real changes made)
(12 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(61 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(213 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(97 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(11 real changes made)
(0 real changes made)
(0 real changes made)
(7 real changes made)
(6 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(13 real changes made)
(3 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2,944 real changes made)
(1,378 real changes made)
(9 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(32 real changes made)
(32 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(204 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(270 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(63 real changes made)
(0 real changes made)
(0 real changes made)
(65 real changes made)
(78 real changes made)
(0 real changes made)
(0 real changes made)
(20 real changes made)
(10 real changes made)
(3 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(5 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(3 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(9 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(56 real changes made)
(140 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(3 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(5 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(3 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. replace lease_details = subinstr(lease_details,"(less 1 day)","",.)
(41,458 real changes made)

. replace lease_details = subinstr(lease_details,"(less one day)","",.)
(22,901 real changes made)

. replace lease_details = subinstr(lease_details,"(Less one day)","",.)
(56 real changes made)

. replace lease_details = subinstr(lease_details,"less 1 day","",.)
(9,218 real changes made)

. replace lease_details = subinstr(lease_details,"less one day","",.)
(12,568 real changes made)

. replace lease_details = subinstr(lease_details,"less a day","",.)
(279 real changes made)

. replace lease_details = subinstr(lease_details,"(except the last day)","",.)
(129 real changes made)

. replace lease_details = subinstr(lease_details,"(except the last day thereof)
> ","",.)
(130 real changes made)

. replace lease_details = subinstr(lease_details,"(except last day)","",.)
(30 real changes made)

. replace lease_details = subinstr(lease_details,"except last day","",.)
(14 real changes made)

. replace lease_details = subinstr(lease_details,"determinable","",.)
(18,459 real changes made)

. 
. replace lease_details = subinstr(lease_details,"1st","1",.)
(4,948 real changes made)

. replace lease_details = subinstr(lease_details,"2nd","2",.)
(130 real changes made)

. replace lease_details = subinstr(lease_details,"3rd","3",.)
(198 real changes made)

. 
. replace lease_details = subinstr(lease_details,"as therein mentioned","",.)
(13,635 real changes made)

. replace lease_details = subinstr(lease_details,"as therein entioned","",.)
(3,916 real changes made)

. replace lease_details = subinstr(lease_details,"()","",.)
(3,275 real changes made)

. 
. replace lease_details = trim(lease_details)
(37,759 real changes made)

. replace lease_details = itrim(lease_details)
(501,505 real changes made)

. 
. replace lease_details = subinstr(lease_details,"FROM:","from",.)
(56 real changes made)

. replace lease_details = subinstr(lease_details,"From:","from",.)
(284 real changes made)

. replace lease_details = subinstr(lease_details,"From","from",.)
(340,592 real changes made)

. 
. replace lease_details = subinstr(lease_details,"TO:","to",.)
(49 real changes made)

. replace lease_details = subinstr(lease_details,"To:","to",.)
(276 real changes made)

. replace lease_details = subinstr(lease_details,"To ","to ",.)
(5,578 real changes made)

. 
. *****************************************************************************
> *********
. * EXTRACT INFO
. * - Now we process the cleaned string to extract the actual lease length info
> rmation
. * - This cycles through a number of approaches of how lease length is recorde
> d
. *****************************************************************************
> *********
. 
. * YEARS 
. gen year_pos     = strpos(lease_details,"years")

. gen number_years = substr(lease_details,1,year_pos-2)
(537,327 missing values generated)

. 
. * "FROM" POSITION
. cap drop from from_pos

. gen     from_pos = strpos(lease_details,"from and including") if number_years
>  != ""
(537,327 missing values generated)

. replace from_pos = strpos(lease_details,"from & including")   if number_years
>  != "" & from_pos == .
(0 real changes made)

. replace from_pos = strpos(lease_details,"commencing on")      if number_years
>  != "" & from_pos == .
(0 real changes made)

. replace from_pos = strpos(lease_details,"commencing in")      if number_years
>  != "" & from_pos == .
(0 real changes made)

. replace from_pos = strpos(lease_details,"from")               if number_years
>  != "" & from_pos == .
(0 real changes made)

. 
. gen from            = substr(lease_details,from_pos + 19,.) if number_years !
> = "" & from_pos != 0
(6,569,074 missing values generated)

. gen has_toincluding = strpos(from,"to and") 

. replace from        = substr(from,1,has_toincluding-2) if has_toincluding != 
> 0
(107,608 real changes made)

. 
. cap drop from_pos

. gen from_pos = strpos(lease_details,"from") if number_years != ""
(537,327 missing values generated)

. replace from = substr(lease_details,from_pos + 5,.) if number_years != "" & f
> rom == ""
variable from was str119 now str285
(6,031,055 real changes made)

. 
. replace from = subinstr(from,"years commencing on and including","",.)
(24,514 real changes made)

. replace from = subinstr(from,"years commencing on","",.)
(50,468 real changes made)

. replace from = subinstr(from,"years commencing","",.)
(5,606 real changes made)

. replace from = subinstr(from,"commencement date of","",.)
(59 real changes made)

. 
. replace from = subinstr(from,"years From","",.)
(0 real changes made)

. replace from = subinstr(from,"form","",.)
(4,722 real changes made)

. replace from = subinstr(from,"years fron","",.)
(0 real changes made)

. replace from = subinstr(from,"and including","",.)
(123,201 real changes made)

. replace from = subinstr(from,"and includng","",.)
(0 real changes made)

. 
. replace from = trim(from)
(81,467 real changes made)

. replace from = itrim(from)
(128,144 real changes made)

. 
. replace from = subinstr(from,"commencing on","",.)
(39,869 real changes made)

. replace from = subinstr(from,"years","",.)
(94,163 real changes made)

. replace from = subinstr(from,"commencing","",.)
(1,690 real changes made)

. replace from = subinstr(from,"()","",.)
(1,311 real changes made)

. 
. replace from = trim(from)
(61,034 real changes made)

. replace from = itrim(from)
(66,897 real changes made)

. 
. replace from = subinstr(from,"first day of","1",.)
(123 real changes made)

. replace from = subinstr(from,"first day","1",.)
(2 real changes made)

. 
. replace from = subinstr(from,"second day of","2",.)
(0 real changes made)

. replace from = subinstr(from,"second day","2",.)
(0 real changes made)

. 
. foreach part in "Beginning on and including" "beginning on and including" "Be
> ginning on" "beginning on" "starting on" "starting of" "ears" "From" "FROM" "
> from" "fom" ///
>                 "term of" "including" "frin" "less" "day" "of" "subject" "(" 
> ")" "on " "beginning" "thereof" "the " "staring on" "except" {               
>               
  2.         replace from = subinstr(from,"`part'","",.)
  3. }
(0 real changes made)
(0 real changes made)
(5 real changes made)
(90,994 real changes made)
(12,754 real changes made)
(1 real change made)
(109,058 real changes made)
(0 real changes made)
(218 real changes made)
(3,136 real changes made)
(718 real changes made)
(6,490 real changes made)
(2,074 real changes made)
(0 real changes made)
(4,760 real changes made)
(11,719 real changes made)
(19,251 real changes made)
(21 real changes made)
(6,612 real changes made)
(6,868 real changes made)
(114,744 real changes made)
(1,047 real changes made)
(0 real changes made)
(22,511 real changes made)
(0 real changes made)
(151 real changes made)

. 
. forval n = 4(1)31 {
  2.         replace from = subinstr(from,"`n'th","`n'",.)
  3. }
(426 real changes made)
(580 real changes made)
(195 real changes made)
(148 real changes made)
(192 real changes made)
(316 real changes made)
(106 real changes made)
(87 real changes made)
(47 real changes made)
(42 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(100 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(80 real changes made)
(0 real changes made)

. 
. foreach ending in "until"  "to " "deter" "Deter" "and" "To " "expir" "up" "en
> ding" "ETER" "last" {
  2.         replace from = substr(from,1,strpos(from,"`ending'")-1) if strpos(
> from,"`ending'") != 0
  3. }
(13,917 real changes made)
(36,904 real changes made)
(36 real changes made)
(843 real changes made)
(129,485 real changes made)
(0 real changes made)
(16,655 real changes made)
(2,038 real changes made)
(10,757 real changes made)
(2 real changes made)
(1,954 real changes made)

. 
. *************************************************
. * Some more String Tricks
. *************************************************
. 
. gen help1     = regexs(0) if (regexm(from,"for [0-9][0-9][0-9]"))
(7,272,031 missing values generated)

. replace from  = subinstr(from,help1,"",.)
(12,512 real changes made)

. replace help1 = subinstr(help1,"for","",.)
(12,512 real changes made)

. replace number_years = help1 if help1 != ""
(12,512 real changes made)

. cap drop help1

. 
. gen help2            = regexs(0) if (regexm(lease_details,"[0-9][0-9][0-9] fr
> om and including"))
(7,284,501 missing values generated)

. replace from         = substr(lease_details,length(help2)+1,.) if length(help
> 2) > 1
(42 real changes made)

. replace number_years = substr(lease_details,1,3) if length(help2) > 1
(33 real changes made)

. cap drop help2

. 
. gen help3            = regexs(0) if (regexm(lease_details,"[0-9][0-9][0-9] fr
> om"))
(7,284,186 missing values generated)

. replace from         = substr(lease_details,length(help3)+1,.) if length(help
> 3) > 1
(357 real changes made)

. replace number_years = substr(lease_details,1,3) if length(help3) > 1
(294 real changes made)

. cap drop help3

. 
. gen help3            = regexs(0) if (regexm(lease_details,"[0-9][0-9][0-9] co
> mmencing on"))
(7,284,521 missing values generated)

. replace from         = substr(lease_details,length(help3)+1,.) if length(help
> 3) > 1
(22 real changes made)

. replace number_years = substr(lease_details,1,3) if length(help3) > 1
(13 real changes made)

. cap drop help3

. 
. gen help3            = regexs(0) if (regexm(lease_details,"[0-9][0-9][0-9] co
> mmencing"))
(7,284,512 missing values generated)

. replace from         = substr(lease_details,length(help3)+1,.) if length(help
> 3) > 1
(31 real changes made)

. replace number_years = substr(lease_details,1,3) if length(help3) > 1
(3 real changes made)

. cap drop help3

. 
. gen help1            = regexs(0) if (regexm(from,"for [0-9][0-9]"))
(7,283,589 missing values generated)

. replace from             = subinstr(from,help1,"",.)
(954 real changes made)

. replace help1            = subinstr(help1,"for","",.)
(954 real changes made)

. replace number_years = help1 if help1 != ""
(954 real changes made)

. cap drop help1

. 
. gen help2            = regexs(0) if (regexm(lease_details,"[0-9][0-9] from an
> d including"))
(7,284,454 missing values generated)

. replace from         = substr(lease_details,length(help2)+1,.) if length(help
> 2) > 1
(89 real changes made)

. replace number_years = substr(lease_details,1,2) if length(help2) > 1
(89 real changes made)

. cap drop help2

. 
. gen help3            = regexs(0) if (regexm(lease_details,"[0-9][0-9] from"))
(7,284,059 missing values generated)

. replace from         = substr(lease_details,length(help3)+1,.) if length(help
> 3) > 1
(484 real changes made)

. replace number_years = substr(lease_details,1,2) if length(help3) > 1
(395 real changes made)

. cap drop help3

. 
. gen help3            = regexs(0) if (regexm(lease_details,"[0-9][0-9] commenc
> ing on"))
(7,284,462 missing values generated)

. replace from         = substr(lease_details,length(help3)+1,.) if length(help
> 3) > 1
(81 real changes made)

. replace number_years = substr(lease_details,1,2) if length(help3) > 1
(81 real changes made)

. cap drop help3

. 
. gen help3            = regexs(0) if (regexm(lease_details,"[0-9][0-9] commenc
> ing"))
(7,284,449 missing values generated)

. replace from         = substr(lease_details,length(help3)+1,.) if length(help
> 3) > 1
(94 real changes made)

. replace number_years = substr(lease_details,1,2) if length(help3) > 1
(10 real changes made)

. cap drop help3

. 
. ************************
. * Get Date for "FROM"
. ************************
. 
. replace from = trim(from)
(275,205 real changes made)

. replace from = itrim(from)
(29,970 real changes made)

. 
. gen date_from     = date(from,"DMY")
(615,190 missing values generated)

. gen date_new1     = date(from,"MDY")
(7,207,014 missing values generated)

. gen date_new2     = date(from,"Y")
(7,283,118 missing values generated)

. gen date_new3     = date(from,"MY")
(7,273,942 missing values generated)

. replace date_from = date_new1 if date_new1 != . & date_from == .
(26 real changes made)

. replace date_from = date_new2 if date_new2 != . & date_from == .
(1,425 real changes made)

. replace date_from = date_new3 if date_new3 != . & date_from == .
(10,601 real changes made)

. 
. foreach dofl in "date of Lease"  "date of lease" "commencement date" {
  2.         replace date_from = date_registered if from == "`dofl'"
  3. }
(0 real changes made)
(0 real changes made)
(53 real changes made)

. 
. format date_from %td

. destring(number_years), replace force
number_years: contains nonnumeric characters; replaced as double
(584278 missing values generated)

. 
. **********************************
. * "From - To" Formulation
. **********************************
. 
. cap drop to_place

. gen      to_place = strpos(lease_details,"to ")

. replace  to_place = strpos(lease_details,"To ")           if to_place == 0
(0 real changes made)

. replace  to_place = strpos(lease_details,"until ")        if to_place == 0
(54,104 real changes made)

. replace  to_place = strpos(lease_details,"TO ")           if to_place == 0
(185 real changes made)

. replace  to_place = strpos(lease_details,"and expiring ") if to_place == 0
(53,774 real changes made)

. replace  to_place = strpos(lease_details,"expiring ")     if to_place == 0
(46,766 real changes made)

. replace  to_place = strpos(lease_details,"and ending")    if to_place == 0
(117,919 real changes made)

. replace  to_place = strpos(lease_details,"ending")        if to_place == 0
(21,712 real changes made)

. replace  to_place = strpos(lease_details,"and ends")      if to_place == 0
(83 real changes made)

. 
. cap drop part*

. gen part1 = substr(lease_details,1,to_place-1) if to_place > 3 & number_years
>  == .
(6,736,862 missing values generated)

. gen part2 = substr(lease_details,to_place,.) if to_place > 3 & number_years =
> = .
(6,736,862 missing values generated)

. 
. replace part1 = subinstr(part1,"Commencing on and including","",.)
(3,336 real changes made)

. replace part1 = subinstr(part1,"commencing on and including","",.)
(4,374 real changes made)

. replace part1 = subinstr(part1,"commencing on","",.)
(12,227 real changes made)

. replace part1 = subinstr(part1,"Commencing on","",.)
(11,879 real changes made)

. replace part1 = subinstr(part1,"from and including","",.)
(161,579 real changes made)

. replace part1 = subinstr(part1,"from","",.)
(293,434 real changes made)

. replace part1 = subinstr(part1,"From and including","",.)
(0 real changes made)

. replace part1 = subinstr(part1,"From","",.)
(0 real changes made)

. replace part1 = subinstr(part1,"Form","",.)
(103 real changes made)

. replace part1 = subinstr(part1,"FROM","",.)
(149 real changes made)

. replace part1 = subinstr(part1,"form","",.)
(71 real changes made)

. replace part1 = subinstr(part1,"For a term","",.)
(591 real changes made)

. replace part1 = subinstr(part1,"Beginning on and including","",.)
(15,154 real changes made)

. replace part1 = subinstr(part1,"beginning on and including","",.)
(18,940 real changes made)

. replace part1 = subinstr(part1,"Beginning on","",.)
(4,852 real changes made)

. replace part1 = subinstr(part1,"beginning on","",.)
(7,980 real changes made)

. replace part1 = subinstr(part1,":","",.)
(336 real changes made)

. replace part1 = subinstr(part1,"the ","",.)
(3,420 real changes made)

. replace part1 = subinstr(part1,"and ","",.)
(9,681 real changes made)

. replace part1 = subinstr(part1,"first day of","",.)
(4 real changes made)

. replace part1 = subinstr(part1,"a term of years","",.)
(5,744 real changes made)

. replace part1 = subinstr(part1,"A term of years","",.)
(5,358 real changes made)

. replace part1 = subinstr(part1,"& including","",.)
(24 real changes made)

. replace part1 = subinstr(part1,"Including","",.)
(298 real changes made)

. replace part1 = subinstr(part1,"including","",.)
(7,222 real changes made)

. replace part1 = subinstr(part1,"th ","",.)
(384 real changes made)

. replace part1 = subinstr(part1,"fom ","",.)
(3 real changes made)

. replace part1 = subinstr(part1,"A term","",.)
(2,701 real changes made)

. 
. foreach ending in "for"  {
  2.         replace part1 = substr(part1,1,strpos(part1,"`ending'")-1) if strp
> os(part1,"`ending'") != 0
  3. }
(3,647 real changes made)

. 
. cap drop date_start

. gen date_start    = date(part1,"DMY")
(6,758,126 missing values generated)

. format date_start %td

. 
. replace part2 = subinstr(part2,"to and including","",.)
(143,516 real changes made)

. replace part2 = subinstr(part2,"To and including","",.)
(0 real changes made)

. replace part2 = subinstr(part2,"and expiring on but not including","",.)
(0 real changes made)

. replace part2 = subinstr(part2,"expiring on but not including","",.)
(7 real changes made)

. replace part2 = subinstr(part2,"and expiring on","",.)
(29,501 real changes made)

. replace part2 = subinstr(part2,"expiring on","",.)
(29,784 real changes made)

. replace part2 = subinstr(part2,"and expiring","",.)
(1,999 real changes made)

. replace part2 = subinstr(part2,"expiring","",.)
(1,789 real changes made)

. replace part2 = subinstr(part2,"to ","",.)
(233,366 real changes made)

. replace part2 = subinstr(part2,"an including","",.)
(251 real changes made)

. replace part2 = subinstr(part2,"expire upon the","",.)
(7 real changes made)

. replace part2 = subinstr(part2,"expire upon","",.)
(12 real changes made)

. replace part2 = subinstr(part2,"expire on the","",.)
(4 real changes made)

. replace part2 = subinstr(part2,"expire on","",.)
(72 real changes made)

. replace part2 = subinstr(part2,"expire","",.)
(7 real changes made)

. replace part2 = subinstr(part2,"inclusive","",.)
(1,098 real changes made)

. replace part2 = subinstr(part2,"the first day of","1",.)
(1 real change made)

. replace part2 = subinstr(part2,"the ","",.)
(1,687 real changes made)

. replace part2 = subinstr(part2,"and ","",.)
(81,992 real changes made)

. replace part2 = subinstr(part2,"an ","",.)
(63 real changes made)

. replace part2 = subinstr(part2,"including","",.)
(61,843 real changes made)

. replace part2 = subinstr(part2,"(determinable)","",.)
(0 real changes made)

. replace part2 = subinstr(part2,"12 noon","",.)
(48 real changes made)

. replace part2 = subinstr(part2,"midnight","",.)
(1,104 real changes made)

. replace part2 = subinstr(part2,"determinable as therein mentioned","",.)
(0 real changes made)

. replace part2 = subinstr(part2,"th ","",.)
(388 real changes made)

. replace part2 = subinstr(part2,"until","",.)
(40,625 real changes made)

. 
. cap drop date_end

. gen date_end = date(part2,"DMY")
(6,814,445 missing values generated)

. format date_end %td

. 
. gen length = round((date_end - date_start) / 365)
(6,825,023 missing values generated)

. 
. replace number_years = length      if number_years == .
(459,520 real changes made)

. replace date_from    = date_start  if date_from == .
(521,071 real changes made)

. 
. compress
  variable year_pos was float now int
  variable has_toincluding was float now byte
  variable from_pos was float now int
  variable to_place was float now int
  variable length was float now int
  variable from was str285 now str139
  variable part1 was str131 now str119
  variable part2 was str242 now str174
  (1,726,436,691 bytes saved)

. 
. save "$WORKING/full_lease_data_cleaned_term.dta", replace
file /Users/vbp/Dropbox
    (Princeton)/wealth-housing/Code/Replication_VBP/Cleaning/Working/stata_wo
    > rking/full_lease_data_cleaned_term.dta saved

. 
. *****************************************************************************
> ***************************************************************** 
. * Drop the (small) number of leases of which we cannot extract lease details 
> from the textual description
. * --> This number is small, given our extensive textual cleaning
. * --> Less than 0.2% of all lease details
. *****************************************************************************
> ***************************************************************** 
. 
. use "$WORKING/full_lease_data_cleaned_term.dta", clear

. 
. // drop if date_from    == .
. drop if number_years == .
(124,758 observations deleted)

. 
. ////////////////////////////////////////////
> // Make merge key
. ////////////////////////////////////////////
> 
. gen merge_key = strtrim(stritrim(upper(description)))
(33,871 missing values generated)

. 
. //Remove commas/periods
. replace merge_key = subinstr(merge_key,".","",.)
(30,886 real changes made)

. // replace merge_key = subinstr(merge_key,",","",.)
. replace merge_key = subinstr(merge_key,"'","",.)
(31,445 real changes made)

. replace merge_key = subinstr(merge_key," ","",.)
(7,125,914 real changes made)

. 
. //Drop missing entries
. drop if missing(merge_key)
(33,871 observations deleted)

. 
. // Change date_from to MONTH-YEAR format
. gen month = month(date_from)
(44,683 missing values generated)

. gen year = year(date_from)
variable year already defined
r(110);

end of do-file
r(110);
