
  ___  ____  ____  ____  ____ Â©
 /__    /   ____/   /   ____/      17.0
___/   /   /___/   /   /___/       MPâ€”Parallel Edition

 Statistics and Data Science       Copyright 1985-2021 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core , expiring 29 Jul 2023
Serial number: 501709222714
  Licensed to: affliate
               Princeton University

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000; see help set_maxvar.

. do 8_merge_all_data.do "/Users/vbp/Dropbox (Princeton)/wealth-housing/Code/Re
> plication_VBP/Cleaning/Working/stata_working" "" 

. global WORKING "`1'"

. 
. di "Working folder: $WORKING"
Working folder: /Users/vbp/Dropbox (Princeton)/wealth-housing/Code/Replication_
> VBP/Cleaning/Working/stata_working

. 
. /////////////////////////////////////
> // COMBINE PRICE DATA WITH AND WITHOUT POSTCODES
. /////////////////////////////////////
> 
. use "$WORKING/merged_data_with_postcodes", clear

. append using "$WORKING/merged_data_without_postcodes"
(label _merge already defined)

. drop if missing(date_trans)
(5 observations deleted)

. 
. di "Number of merged observations:"
Number of merged observations:

. di _N
6304045

. 
. /////////////////////////////////////
> // MERGE DATA INTO LEASE DATA
. /////////////////////////////////////
> 
. // Merge back into lease data
. cap drop _merge

. joinby merge_key using "$WORKING/lease_data.dta"

. save "$WORKING/merged_data.dta", replace
file /Users/vbp/Dropbox
    (Princeton)/wealth-housing/Code/Replication_VBP/Cleaning/Working/stata_wo
    > rking/merged_data.dta saved

. 
. sort property_id date_trans date_registered

. drop v16 unique_id merge_key* merge_num property_id_* dup* date

. 
. ////////////////////////////////////////////
> // Aggregate at quarter level
. ////////////////////////////////////////////
> 
. gen  year          = year(date_trans)
variable year already defined
r(110);

end of do-file
r(110);
